In [1]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Delhi', 'Mumbai', 'Chennai']
}

df = pd.DataFrame(data)
print(df)

      Name  Age     City
0    Alice   25    Delhi
1      Bob   30   Mumbai
2  Charlie   35  Chennai

In [2]:
data["Name"]

['Alice', 'Bob', 'Charlie']

In [3]:
df["Name"]

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [4]:
df['Name']              # Access single column (as Series)
df[['Name', 'City']]    # Multiple columns (as DataFrame)

      Name     City
0    Alice    Delhi
1      Bob   Mumbai
2  Charlie  Chennai

In [5]:
df.loc[1]               # Access by index label

Name       Bob
Age         30
City    Mumbai
Name: 1, dtype: object

In [6]:
df[1:3]                 # Rows 1 to 2

      Name  Age     City
1      Bob   30   Mumbai
2  Charlie   35  Chennai

In [7]:
df.shape           # (rows, columns)

(3, 3)

In [8]:
df.columns         # List of column names

Index(['Name', 'Age', 'City'], dtype='object')

In [9]:
df.index           # Row index

RangeIndex(start=0, stop=3, step=1)

In [10]:
df.dtypes          # Data types of columns

Name    object
Age      int64
City    object
dtype: object

In [11]:
df.describe()      # Summary statistics

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [12]:
df.info()          # DataFrame info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [13]:
df['Age'] = df['Age'] + 1              # Modify column

In [14]:
df

      Name  Age     City
0    Alice   26    Delhi
1      Bob   31   Mumbai
2  Charlie   36  Chennai

In [15]:
df["Country"]= "India"

In [16]:
df

      Name  Age     City Country
0    Alice   26    Delhi   India
1      Bob   31   Mumbai   India
2  Charlie   36  Chennai   India

In [17]:
df['Age'] = df['Age'] + 1              # Modify column
df['Country'] = 'India'                # Add new column
df.drop('City', axis=1, inplace=True)  # Drop column

In [18]:
df

      Name  Age Country
0    Alice   27   India
1      Bob   32   India
2  Charlie   37   India

Try this:

Create a DataFrame with:

Student: ['A', 'B', 'C']

Marks: [88, 92, 85]

Grade: ['A', 'A', 'B']

Print the first and last rows.

Add a column called 'Passed' (True/False based on marks > 90).

Drop the 'Grade' column.

In [25]:
school = {
    "Students" : ["A", "B", "C"],
    "Marks" : [88, 92 , 85],
    "Grade" : ["A", "B" ,"C"]
}

df = pd.DataFrame(school)

In [26]:
school

{'Students': ['A', 'B', 'C'], 'Marks': [88, 92, 85], 'Grade': ['A', 'B', 'C']}

In [28]:
df.shape

(3, 3)

In [29]:
df.head(2)

  Students  Marks Grade
0        A     88     A
1        B     92     B

In [30]:
df.tail(2)

  Students  Marks Grade
1        B     92     B
2        C     85     C

In [32]:
df["Passed"]= df["Marks"] > 90

In [33]:
df

  Students  Marks Grade  Passed
0        A     88     A   False
1        B     92     B    True
2        C     85     C   False

In [34]:
df.drop("Grade" , axis = 1, inplace = True)

In [35]:
df

  Students  Marks  Passed
0        A     88   False
1        B     92    True
2        C     85   False